lab2/planning.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-02-25 Mon 09:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lab2 Planning</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Kenneth Bruce" />
</head>
<body>
<div id="content">
<h1 class="title">Lab2 Planning</h1>

<div id="outline-container-org910dd51" class="outline-2">
<h2 id="org910dd51"><span class="section-number-2">1</span> Rules Generator</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orge8dd0db" class="outline-3">
<h3 id="orge8dd0db"><span class="section-number-3">1.1</span> <span class="done DONE">DONE</span> Basic utility</h3>
</div>

<div id="outline-container-org90f25e5" class="outline-3">
<h3 id="org90f25e5"><span class="section-number-3">1.2</span> <span class="todo TODO">TODO</span> User input cleanup</h3>
</div>

<div id="outline-container-orgb47ed96" class="outline-3">
<h3 id="orgb47ed96"><span class="section-number-3">1.3</span> <span class="todo TODO">TODO</span> Add static functions</h3>
</div>
</div>

<div id="outline-container-org58ffd92" class="outline-2">
<h2 id="org58ffd92"><span class="section-number-2">2</span> Clue Generator</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org4020860" class="outline-3">
<h3 id="org4020860"><span class="section-number-3">2.1</span> <span class="done DONE">DONE</span> Giant case statement</h3>
</div>

<div id="outline-container-orgac5abe6" class="outline-3">
<h3 id="orgac5abe6"><span class="section-number-3">2.2</span> <span class="todo IN_PROGRESS">IN-PROGRESS</span> Display correct template for all cases</h3>
</div>

<div id="outline-container-orgcbd7033" class="outline-3">
<h3 id="orgcbd7033"><span class="section-number-3">2.3</span> <span class="todo TODO">TODO</span> Prompt for filling out templat</h3>
</div>

<div id="outline-container-org9360330" class="outline-3">
<h3 id="org9360330"><span class="section-number-3">2.4</span> <span class="todo TODO">TODO</span> User input cleanup</h3>
</div>
</div>

<div id="outline-container-org7f2d909" class="outline-2">
<h2 id="org7f2d909"><span class="section-number-2">3</span> Prolog Static Functions</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org595d0da" class="outline-3">
<h3 id="org595d0da"><span class="section-number-3">3.1</span> <span class="todo IN_PROGRESS">IN-PROGRESS</span> Have way to display all the clues</h3>
</div>

<div id="outline-container-orgc943548" class="outline-3">
<h3 id="orgc943548"><span class="section-number-3">3.2</span> <span class="todo TODO">TODO</span> Format user output for all clues</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-orgb7eaa46" class="outline-4">
<h4 id="orgb7eaa46"><span class="section-number-4">3.2.1</span> All clues</h4>
<div class="outline-text-4" id="text-3-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Number</th>
<th scope="col" class="org-right">Clue Prog</th>
<th scope="col" class="org-left">Generic Template</th>
<th scope="col" class="org-left">Query Template</th>
<th scope="col" class="org-left">Formatted?</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">05</td>
<td class="org-left">Where was <i>suspect</i> in <i>timeofday</i></td>
<td class="org-left">where<sub>was</sub>(Suspect, Time)</td>
<td class="org-left">YES</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">09</td>
<td class="org-left">Was <i>suspect</i> ever in <i>location</i>?</td>
<td class="org-left">was<sub>ever</sub>(Suspect, Location)</td>
<td class="org-left">YES</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-right">14</td>
<td class="org-left">What is <i>suspect’s</i> weapon?</td>
<td class="org-left">which<sub>weapon</sub>(Suspect)</td>
<td class="org-left">YES</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-right">19</td>
<td class="org-left">List a gender <i>suspect</i>.</td>
<td class="org-left">gender(Suspect)</td>
<td class="org-left">YES</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-right">24</td>
<td class="org-left">How old is <i>suspect</i>?</td>
<td class="org-left">what<sub>age</sub>(Suspect)</td>
<td class="org-left">YES</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-right">27</td>
<td class="org-left">Who are all the <i>gender</i>?</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-right">31</td>
<td class="org-left">Are any suspects over <i>integer years</i> old?</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-right">35</td>
<td class="org-left">Are any suspects exactly <i>integer years</i> old?</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-right">40</td>
<td class="org-left">How many suspects use <i>weapon</i>?</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">44</td>
<td class="org-left">What suspects use <i>weapon</i>?</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-right">47</td>
<td class="org-left">Where was <i>suspect</i> all day?</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">12</td>
<td class="org-right">51</td>
<td class="org-left">Where <i>suspect1</i> and <i>suspect2</i> ever at the same place at the same time?</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">13</td>
<td class="org-right">64</td>
<td class="org-left">What is the gender of the murderer?</td>
<td class="org-left">murderer<sub>gender</sub>.</td>
<td class="org-left">YES</td>
</tr>

<tr>
<td class="org-right">14</td>
<td class="org-right">56</td>
<td class="org-left">What is the name of the murderer?</td>
<td class="org-left">murderer<sub>name</sub>.</td>
<td class="org-left">YES</td>
</tr>

<tr>
<td class="org-right">15</td>
<td class="org-right">59</td>
<td class="org-left">When was the murder committed?</td>
<td class="org-left">murderer<sub>time</sub>.</td>
<td class="org-left">YES</td>
</tr>

<tr>
<td class="org-right">16</td>
<td class="org-right">62</td>
<td class="org-left">Where was the murder committed?</td>
<td class="org-left">murderer<sub>location</sub>.</td>
<td class="org-left">YES</td>
</tr>

<tr>
<td class="org-right">17</td>
<td class="org-right">65</td>
<td class="org-left">What weapon was used for the murder?</td>
<td class="org-left">murderer<sub>weapon</sub>.</td>
<td class="org-left">YES</td>
</tr>

<tr>
<td class="org-right">18</td>
<td class="org-right">68</td>
<td class="org-left">How old is the murderer?</td>
<td class="org-left">murderer<sub>age</sub>.</td>
<td class="org-left">YES</td>
</tr>

<tr>
<td class="org-right">19</td>
<td class="org-right">71</td>
<td class="org-left"><i>Suspect</i> was not the murderer</td>
<td class="org-left">is<sub>murderer</sub>(Suspect).</td>
<td class="org-left">YES</td>
</tr>

<tr>
<td class="org-right">20</td>
<td class="org-right">74</td>
<td class="org-left"><i>Weapon</i> was not used in the murderer</td>
<td class="org-left">is<sub>murder</sub><sub>weapon</sub>(Weapon)</td>
<td class="org-left">YES</td>
</tr>

<tr>
<td class="org-right">21</td>
<td class="org-right">77</td>
<td class="org-left">The murder did not occur at <i>time</i>?</td>
<td class="org-left">is<sub>murder</sub><sub>time</sub>(Time).</td>
<td class="org-left">YES</td>
</tr>

<tr>
<td class="org-right">22</td>
<td class="org-right">80</td>
<td class="org-left">The murder did not occur at <i>location</i>?</td>
<td class="org-left">is<sub>murder</sub><sub>location</sub>(Location).</td>
<td class="org-left">YES</td>
</tr>

<tr>
<td class="org-right">23</td>
<td class="org-right">85</td>
<td class="org-left">When was <i>suspect</i> at <i>location</i>?</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">24</td>
<td class="org-right">88</td>
<td class="org-left"><i>Suspect</i> was never at <i>location</i>?</td>
<td class="org-left">was<sub>ever</sub>(Suspect, Location)</td>
<td class="org-left">YES</td>
</tr>

<tr>
<td class="org-right">25</td>
<td class="org-right">91</td>
<td class="org-left">What are the <i>locations</i>?</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">26</td>
<td class="org-right">94</td>
<td class="org-left">When are the <i>times</i>?</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">27</td>
<td class="org-right">96</td>
<td class="org-left">Is the murderer <i>suspect1</i> or <i>suspect2</i>?</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">28</td>
<td class="org-right">98</td>
<td class="org-left">Was the murder weapon <i>weapon1</i> or <i>weapon2</i>?</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>


<div id="outline-container-orgcb9ad0f" class="outline-2">
<h2 id="orgcb9ad0f"><span class="section-number-2">4</span> Stretch Goals</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgcee750b" class="outline-3">
<h3 id="orgcee750b"><span class="section-number-3">4.1</span> <span class="todo TODO">TODO</span> Automoderator</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Kenneth Bruce</p>
<p class="date">Created: 2019-02-25 Mon 09:35</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
